posts/20220115203554-ae_ternity_open_source_blockchain_for_scalable_and_secure_smart_contracts.org
:PROPERTIES:
:ID:       f6bd1cf8-65fd-4a8a-82d2-409e1b98017e
:ROAM_REFS: cite:saschahanse
:END:
#+TITLE: aeternity Open source blockchain for scalable and secure smart contracts
#+CREATED: [2022-01-15 Sat 20:35]
#+LAST_MODIFIED: [2022-02-09 Wed 09:53]

Focused on scaling:
- /State channels/ allow millions of transactions per second;
- /Bitcoin-NG/ PoW allow 117 on-chain transactions/s and blocktime of 3 seconds;
- Hyperchains

AE coins require for any operation on aeternity blockchain.

With generalized accounts, users can use smart contracts to authenticate => they can sign transactions with BTC, ETH, ect private keys.

One can claim /names/ on the chain.

/Oracles/ bring external data to the blockchain.

*payingfor transactions* so users can use the blockchain without having to buy coins

Smart contracts are programs that can perform tasks with data /on the blockchain/.

* TODO List all possible transactions
* TODO Compare to transactions on e.g. ethereum
* TODO Compare smart cntracts to ethereum
* TODO Read hyperchains paper  [[cite:&zotero-5020]]
