20220115203554-ae_ternity_open_source_blockchain_for_scalable_and_secure_smart_contracts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>aeternity Open source blockchain for scalable and secure smart contracts</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">aeternity Open source blockchain for scalable and secure smart contracts</h1>
<p>
Focused on scaling:
</p>
<ul class="org-ul">
<li><i>State channels</i> allow millions of transactions per second;</li>
<li><i>Bitcoin-NG</i> PoW allow 117 on-chain transactions/s and blocktime of 3 seconds;</li>
<li>Hyperchains</li>
</ul>

<p>
AE coins require for any operation on aeternity blockchain.
</p>

<p>
With generalized accounts, users can use smart contracts to authenticate =&gt; they can sign transactions with BTC, ETH, ect private keys.
</p>

<p>
One can claim <i>names</i> on the chain.
</p>

<p>
<i>Oracles</i> bring external data to the blockchain.
</p>

<p>
<b>payingfor transactions</b> so users can use the blockchain without having to buy coins
</p>

<p>
Smart contracts are programs that can perform tasks with data <i>on the blockchain</i>.
</p>

<div id="outline-container-org5dc5594" class="outline-2">
<h2 id="org5dc5594"><span class="todo TODO">TODO</span> List all possible transactions</h2>
</div>
<div id="outline-container-org0b1d6b4" class="outline-2">
<h2 id="org0b1d6b4"><span class="todo TODO">TODO</span> Compare to transactions on e.g. ethereum</h2>
</div>
<div id="outline-container-orgf9be6c6" class="outline-2">
<h2 id="orgf9be6c6"><span class="todo TODO">TODO</span> Compare smart cntracts to ethereum</h2>
</div>
<div id="outline-container-org83b3571" class="outline-2">
<h2 id="org83b3571"><span class="todo TODO">TODO</span> Read hyperchains paper  </h2>
</div>

<div id="outline-container-org54db2c8" class="outline-2">
<h2 id="org54db2c8">Links to this note</h2>
</div>
</div>
</body>
</html>
